[
	{
		"id": 32,
		"title": "Copper Age 1.21.9 Items + Transport Category",
		"date": "2025-11-08",
		"types": ["Content"],
		"hidden": false,
		"description": "Added all Copper Age (Minecraft 1.21.9) items to the catalog and reorganized mobility gear into a dedicated Transport category.",
		"changes": [
			"Copper gear set: copper tools, weapons, armor, and horse armor",
			"Copper structures & lighting: bars, chains, chest, torch, lantern, and every oxidized/waxed variant",
			"Additional items: decorative storage shelves, copper golem statue, oxidized lightning rod variant, copper nugget",
			"Created new Transport category featuring boats, minecarts, saddle, harnesses, and elytra"
		]
	},
	{
		"id": 31,
		"title": "Region Forge Tool",
		"date": "2025-11-05",
		"type": "Tool",
		"hidden": false,
		"description": "Added Region Forge to the Tools page! Draw, edit, and manage WorldGuard regions on an interactive Map Canvas, and then export to regions.yml to use on your server. I've been dreaming of being able to make regions for unexplored worlds for world building purposes, so I ended up building my own tool. It's quite unique and powerful, and a joy to use.",
		"link": "https://www.minecraftregionforge.com/",
		"linkText": "Minecraft Region Forge for WorldGuard",
		"changes": [
			"Generate map images from Minecraft seeds (2k–16k) or load your own via URL",
			"Create regions by clicking points or drawing freehand—click to place vertices or hold and drag for smooth curves",
			"Edit region shapes by dragging points, move entire regions, split them along two points, resize them, and simplify or adjust complexity",
			"Save complete projects to a single file and load them to restore everything",
			"Export all regions to WorldGuard regions.yml file with configurable greeting/farewell messages, ready to use in your server",
			"Pan by holding Space and dragging, zoom with the mouse wheel, adjust map opacity, and toggle grid overlay and region highlights"
		]
	},
	{
		"id": 30,
		"title": "Crafting Ingredients Tooltip - A Little Extra Help!",
		"date": "2025-10-29",
		"types": ["Enhancement"],
		"hidden": false,
		"description": "I added a little something extra that I think you'll find pretty handy. For items with dynamic pricing (the ones calculated from crafting ingredients), you can now click the little 4-square icon to see exactly what ingredients go into making them. It's like having a mini ingredient list right there in the price guide! Just a small quality-of-life improvement to make the price guide a bit more useful.",
		"changes": [
			"Added crafting ingredients hover panels for dynamically priced items - click the 4-square icon to see ingredients",
			"Shows ingredient icons, quantities, and names in a clean, easy-to-read format",
			"Layout-responsive design - larger and more spacious in 'Comfortable' mode, smaller in 'Compact' mode"
		]
	},
	{
		"id": 29,
		"title": "Export Price List Update - Sort Order & Rounding Options",
		"date": "2025-10-29",
		"types": ["Enhancement"],
		"hidden": false,
		"description": "Added sort order and rounding options to the export modal based on user feedback from noobieX4231. You can now choose how items are ordered in exports and control whether prices are rounded to whole numbers, matching the functionality available in the main price guide interface.",
		"changes": [
			"Added sort order options: Default Order, Name, and Buy Price with ascending/descending options",
			"Added 'Round to whole numbers' checkbox to control price precision in exports"
		]
	},
	{
		"id": 28,
		"title": "Suggestion System Updates",
		"date": "2025-10-23",
		"types": ["Enhancement", "Community"],
		"hidden": false,
		"description": "Made some improvements to the suggestion system. Updated the interface to be more consistent with the rest of the site and added a messaging feature so I can discuss your suggestion with you.",
		"changes": [
			"Updated suggestion interface styling",
			"Added messaging system for suggestion discussions",
			"Improved suggestion form and admin interface"
		]
	},
	{
		"id": 27,
		"title": "Minecraft 1.21 Tricky Trials - Complete Item Catalog! ",
		"date": "2025-10-19",
		"types": ["Content"],
		"hidden": false,
		"description": "🎉 The Tricky Trials Update is now fully integrated! Added all 1.21 items with comprehensive pricing and crafting recipes. The catalog now features over 150 new items including the complete pale oak wood set, copper building blocks, trial chambers content, and much more. I've also created a dedicated 'Copper' category to better organize the extensive copper item collection. This update covers Minecraft 1.21.8 and does not include the recent 'Copper Age' 1.21.9 items (coming soon, promise!).",
		"changes": [
			"Completed all 1.21 items including pale oak wood set, tuff blocks, resin blocks, and copper variants",
			"Added comprehensive pricing for all 1.21 content (150+ new items)",
			"Added all crafting recipes for 1.21 items to the recipe database",
			"Created new 'Copper' category for all copper-related items and building blocks",
			"Added trial chambers content including trial keys, ominous trial keys, and trial spawners",
			"Added new tools and items including mace, wind charge, wolf armor, and armadillo scute",
			"Added copper building blocks including doors, trapdoors, grates, and bulbs in all oxidation states",
			"Added bundle and harness variants in all 16 colors",
			"Added decorative items including banner patterns, music discs, and smithing templates",
			"Updated external resource links to use minecraft.wiki instead of minecraft.fandom"
		]
	},
	{
		"id": 26,
		"title": "Minecraft 1.21 Support & Interface Improvements",
		"date": "2025-10-18",
		"types": ["Enhancement", "Content"],
		"hidden": false,
		"description": "OK! Time to get those 1.21 items in. I've enabled it with a handful of items, with a lot more to come in the next week or so. The category filtering system has been redesigned to be more intuitive, and the homepage code has been streamlined for better performance.",
		"changes": [
			"Added Minecraft 1.21 version support with a few items (more items coming soon)",
			"Streamlined category filtering system for better user experience",
			"Replaced 'Unselect/Select categories' with more intuitive 'All categories' filter",
			"Removed unnecessary 'Uncategorised' selector from category filters",
			"Prominently display Minecraft version for better catalog identification",
			"Reduced homepage code complexity for improved performance and maintainability"
		]
	},
	{
		"id": 25,
		"title": "Crate Rewards Tool",
		"date": "2025-10-16",
		"type": "Tool",
		"hidden": false,
		"description": "I wanted to do something a little bit different and expand what this site offers beyond just the price guide. So I thought, how about some of the tools I've been building for myself?\n\nThe Crate Rewards Tool is the first of these - it's what I use to build and manage my own CrazyCrates configurations. Build custom crate rewards with items, weights, and enchantments, then export them directly to YAML format for your server.\n\nI also took the opportunity to clean up a few other things while I was at it - added some icons to the main navigation, changed 'Home' to 'Price Guide' for clarity, and cleaned up the styling on this page.\n\nCrate Rewards Tool features:",
		"changes": [
			"New Crate Rewards Tool for CrazyCrates plugin configuration",
			"Build crate prizes one item at a time with custom quantities and weights",
			"See the value of each prize to help balance your crate rewards",
			"Import existing crate configurations from YAML files",
			"Export your crates in CrazyCrates Prizes YAML format for easy server integration",
			"Set custom values and enchantments for each reward",
			"Simulate rewards to test your crate configurations",
			"Support for all Minecraft versions (1.16 through 1.20)",
			"Note: The tool might be a bit wonky on mobile - I'm still working on that part!"
		]
	},
	{
		"id": 24,
		"title": "Homepage Performance Boost & Search Enhancements",
		"date": "2025-10-03",
		"type": "Enhancement",
		"hidden": false,
		"description": "Performance improvements to the homepage for faster loading and smoother interactions. Also enhanced search functionality and added stack size display with user customization options.",
		"changes": [
			"Significant homepage performance improvements for faster loading and smoother interactions",
			"Optimized rendering and data processing for better user experience",
			"Search now supports spaces in search terms for more natural searching",
			"Added stack size display for items with toggleable setting in Settings",
			"Restyled category filter buttons for improved visual consistency"
		]
	},
	{
		"id": 23,
		"title": "Discord Community Server - Join the Conversation! 💬",
		"date": "2025-09-12",
		"type": "Community",
		"hidden": false,
		"description": "🎉 I've created a Discord server for the price guide community! This is a place where you can chat with other users, get help with pricing questions, share feedback, and stay updated on new features.",
		"link": "https://discord.gg/bz6ckxGZKw",
		"linkText": "verzion's price guide discord server",
		"changes": [
			"New Discord server for community discussions and support",
			"Discord link added to the site footer for easy access",
			"Join the conversation with other price guide users",
			"Get help with pricing questions and share feedback",
			"Stay updated on new features and announcements"
		]
	},
	{
		"id": 22,
		"title": "Export Price List - New Feature! 📊",
		"date": "2025-09-11",
		"type": "Feature",
		"hidden": false,
		"description": "🎉 You can now export the price list! This feature was a user suggestion (thanks William!) and covers everything you need - whether you want to share prices with your server community, backup your data, or use the prices in other tools, the new export feature has you covered with multiple formats.",
		"changes": [
			"Export the price list in JSON format for easy integration with other tools",
			"Export the price list in YAML format for human-readable data",
			"Export one or multiple categories to get exactly what you need",
			"Export includes item data (names, prices, categories, stack size) for the selected Minecraft version",
			"Easy access from the homepage with a dedicated export button"
		]
	},
	{
		"id": 21,
		"title": "User Accounts Complete + New Suggestions Feature!",
		"date": "2025-07-23",
		"type": "Feature",
		"description": "🎉 User accounts are now fully functional! Complete with email verification, password management, and account security. Plus, I've added a new suggestions system where you can submit feedback and ideas to help improve the site.",
		"changes": [
			"Complete user registration with email verification",
			"Password reset and account recovery system",
			"User profile management with Minecraft usernames and avatars",
			"New suggestions feature - submit feedback and ideas",
			"Admin suggestions management with status updates",
			"Secure authentication and authorization throughout"
		]
	},
	{
		"id": 20,
		"title": "Mobile Navigation & UI Improvements",
		"date": "2025-07-20",
		"type": "Enhancement",
		"description": "🎉 Mobile users, this one's for you! Completely redesigned the mobile navigation with a proper hamburger menu and smart sticky behavior. Also cleaned up the homepage to be less cluttered on mobile by hiding category filters by default.",
		"changes": [
			"Slim mobile header with just the logo and menu button",
			"Smart sticky navigation that hides when scrolling down and reappears when scrolling up",
			"Category filters are now hidden by default on mobile to save screen space",
			"Easy toggle to show/hide category filters when needed",
			"Logo now scrolls to top when clicked on homepage"
		]
	},
	{
		"id": 19,
		"title": "Minecraft 1.20 Trails & Tales - Complete!",
		"date": "2025-07-17",
		"type": "Content",
		"description": "🎉 The Trails & Tales Update is now fully integrated! Added all 1.20 items with smart pricing and crafting recipes. The catalog now features over 1240 items including the new archaeology category.",
		"changes": [
			"Completed all 1.20 items including bamboo & cherry wood sets, hanging signs, and pottery sherds",
			"Added comprehensive pricing for all 1.20 content",
			"Added all crafting recipes for 1.20 items to the recipe database",
			"Added all armor trim smithing templates",
			"Created new 'Archaeology' category for pottery sherds and related items",
			"Recalculated Netherite item prices with the Netherite Upgrade Smithing Template in mind"
		]
	},
	{
		"id": 18,
		"title": "All 1.19 Items Complete + New Categories!",
		"date": "2025-07-16",
		"type": "Content",
		"description": "🎉 All Minecraft 1.19 items have now been added to the price guide! The Wild Update content is now fully integrated with comprehensive pricing. I've also created two new categories to better organize the growing item collection.",
		"changes": [
			"Completed all 1.19 items including mangrove wood, sculk blocks, mud blocks, and frog-related items",
			"Added comprehensive pricing for all 1.19 content",
			"Added all crafting recipes for 1.19 items to the recipe database",
			"Created new 'Light' category for lighting-related items",
			"Created new 'Deep Dark' category for sculk and deep dark specific items"
		]
	},
	{
		"id": 17,
		"title": "Homepage Filtering Cleanup",
		"date": "2025-07-16",
		"type": "Enhancement",
		"description": "Made some UX improvements that I hope make the homepage a bit easier to use. Cleaned up the filtering and controls, and made use of icons here and there.",
		"changes": [
			"Less cluttered filtering controls",
			"Settings and filters should be easier to spot",
			"A few more icons to help guide you",
			"Filtering should feel better on mobile too"
		]
	},
	{
		"id": 16,
		"title": "Spruced Up Header with Minecraft Vibes",
		"date": "2025-07-15",
		"type": "Enhancement",
		"description": "The site header needed a bit of a facelift, so I spruced it up with a more Minecraft-inspired style and visuals. Think I'll be working on the designs now and then to try and make improvements."
	},
	{
		"id": 15,
		"title": "Smart Pricing System - Now Live! 🎉",
		"date": "2025-07-14",
		"type": "Feature",
		"description": "🎉 The price guide just got a whole lot smarter! I've completely upgraded the pricing system to calculate item prices based on their crafting recipes. This means prices are now much more accurate and realistic across all Minecraft versions.",
		"changes": [
			"Recipe-based price calculations - items are priced based on their ingredients",
			"Version-aware pricing - different prices for different Minecraft versions",
			"Easy price updates - when ingredient prices change, I can easily recalculate everything",
			"Recipe database - 639 crafting recipes now power the pricing system",
			"Batch recalculations - update hundreds of prices at once with a single click",
			"More accurate prices - no more guessing, everything is based on actual crafting costs"
		]
	},
	{
		"id": 14,
		"title": "Roadmap Improvements",
		"date": "2025-07-11",
		"type": "Enhancement",
		"description": "Improved the roadmap display with better organization and status clarity.",
		"changes": [
			"Sorted roadmap entries by status priority",
			"Added dependency tracking between features",
			"Completed items are now hidden by default",
			"Added new roadmap entry for Version-Aware Pricing and Recipe Integration"
		]
	},
	{
		"id": 13,
		"title": "All 1.17 Items Complete + 1.18 Ready! 🎉",
		"date": "2025-07-08",
		"type": "Content",
		"description": "All Minecraft 1.17 items have now been added to the price guide. Additionally, 1.18 support is now complete as it only required adding 1 new disc item.",
		"changes": [
			"Completed all 1.17 items including copper blocks, deepslate, candles, azalea items, and amethyst variants",
			"Added comprehensive pricing for all 1.17 content (101 total items)",
			"1.18 version support is now complete with the addition of Music Disc 'otherside'"
		]
	},
	{
		"id": 12,
		"title": "All 1.16 Items Complete (Except Brewing) - Major Milestone! 🎉",
		"date": "2025-07-03",
		"type": "Content",
		"description": "🎉 Another major milestone achieved! All Minecraft 1.16 items have now been categorized and priced, with the exception of the upcoming brewing category. This represents hundreds of items across all categories.",
		"changes": [
			"Completed all remaining 50 or so 1.16 items with accurate pricing",
			"These items were nether star, kelp, turtle shell, fireworks and minecarts to name a few",
			"Only brewing category remains for complete 1.16 coverage"
		]
	},
	{
		"id": 11,
		"title": "Homepage UI Improvements",
		"date": "2025-07-03",
		"type": "Enhancement",
		"description": "Small but effective UI improvements to the homepage for better user experience and customization.",
		"changes": [
			"Added layout setting (comfortable/condensed) for table density preference",
			"Reduced font size for category filters for cleaner appearance",
			"Added option to hide/show category filters to reduce clutter"
		]
	},
	{
		"id": 10,
		"title": "Multi-Version Support Now Live! 🚀",
		"date": "2025-07-01",
		"type": "Feature",
		"description": "Major infrastructure update! The price guide now supports multiple Minecraft versions. You can switch between 1.16 and 1.17 versions, with more versions being added progressively. Note there's only a handful of 1.17 items at this point. This foundation enables me to expand to all Minecraft versions over time.",
		"changes": [
			"Added version selector on homepage - switch between Minecraft versions",
			"Currently supporting 1.16 and 1.17 versions",
			"Smart filtering - items only show for their supported versions",
			"Foundation laid for adding 1.18, 1.19, 1.20, 1.21 and future versions"
		]
	},
	{
		"id": 9,
		"title": "All 1.16 Enchanted Books Added with Accurate Pricing!",
		"date": "2025-06-28",
		"type": "Content",
		"description": "🎉 Complete enchanted book catalog is now live! Added all 110 enchanted books covering every enchantment type and level from Minecraft 1.16. Each book has been priced accurately based on rarity, usefulness, and market demand.",
		"changes": [
			"Added all 110 enchanted books with accurate pricing",
			"Price range from 80 (Bane of Arthropods I) to 1400 (Mending)",
			"New 'Enchantments' category for easy browsing"
		]
	},
	{
		"id": 8,
		"title": "Price Customization, List View & Table Sorting",
		"date": "2025-06-28",
		"type": "Feature",
		"description": "Major UX enhancement introducing customizable pricing and flexible viewing options for better user experience.",
		"changes": [
			"Added price customization controls (buy multiplier and sell percentage)",
			"New 'List' view option alongside traditional 'Categories' view",
			"Alphabetical sorting by default in List view",
			"Clickable column headers for sorting by item name or buy price",
			"'Round to whole' option for cleaner price display",
			"All settings are automatically saved and remembered",
			"Improved decimal precision for accurate pricing calculations"
		]
	},
	{
		"id": 7,
		"title": "Complete 1.16 catalog (pricing and images) - COMPLETED!",
		"date": "2025-06-27",
		"type": "Content",
		"description": "🎉 Major milestone achieved! All 19 categories in the 1.16 catalog now have complete pricing and correct images. This includes Ores, Stone, Earth, Sand, Wood, Drops, Food, Utility, Plants, Redstone, Nether, Ocean, Tools, Weapons, Armor, End, Ice, Dyed, and Discs categories. The price guide is now fully functional for all included items!"
	},
	{
		"id": 1,
		"title": "Smart number formatting for prices and item count on category filters",
		"date": "2025-06-25",
		"type": "Enhancement",
		"description": "Large numbers now display with smart formatting (20k instead of 20000, 1.3M instead of 1300000) making prices easier to read at a glance. Category filters now display the item count."
	},
	{
		"id": 1,
		"title": "Catalog update: Armor, End, Ice and Dyed prices added + updated images. Books category removed.",
		"date": "2025-06-25",
		"type": "Content",
		"description": "Added prices to all the items within the Armor, End, Ice and Dyed categories. Fixed incorrect images as well. Moved Book, Book and Quill and Bookshelf into the Utility category. Removed the Books category all together. I'll be making an 'Enchantments' category later instead."
	},
	{
		"id": 1,
		"title": "Catalog update: Ocean items, Tools and Weapons priced + updated images",
		"date": "2025-06-23",
		"type": "Content",
		"description": "Added prices to all the items within the Ocean, Tools and Weapons categories. Fixed incorrect images as well."
	},
	{
		"id": 1,
		"title": "Catalog update: Nether items priced and updated images",
		"date": "2025-06-22",
		"type": "Content",
		"description": "Added prices to all the items within the Nether category. Fixed incorrect images as well."
	},
	{
		"id": 1,
		"title": "Added an 'Update' page with latest updates and roadmap",
		"date": "2025-06-20",
		"type": "Content",
		"description": "Added this page to show you all that stuff is happening :)"
	},
	{
		"id": 2,
		"title": "Almost Complete 1.16 Items List, Search and Categories Filtering",
		"date": "2025-05-19",
		"type": "Feature",
		"description": "Major content update adding almost all items from Minecraft 1.16 with categories and item search.",
		"changes": [
			"Added almost complete 1.16 items",
			"Total of 20 item categories",
			"Category filtering",
			"Search functionality across all items"
		]
	}
]
