[
	{
		"id": 16,
		"title": "Spruced Up Header with Minecraft Vibes",
		"date": "2025-07-15",
		"type": "Enhancement",
		"description": "The site header needed a bit of a facelift, so I spruced it up with a more Minecraft-inspired style and visuals. Think I'll be working on the designs now and then to try and make improvements."
	},
	{
		"id": 15,
		"title": "Smart Pricing System - Now Live! 🎉",
		"date": "2025-07-14",
		"type": "Feature",
		"description": "🎉 The price guide just got a whole lot smarter! I've completely upgraded the pricing system to calculate item prices based on their crafting recipes. This means prices are now much more accurate and realistic across all Minecraft versions.",
		"changes": [
			"Recipe-based price calculations - items are priced based on their ingredients",
			"Version-aware pricing - different prices for different Minecraft versions",
			"Easy price updates - when ingredient prices change, I can easily recalculate everything",
			"Recipe database - 639 crafting recipes now power the pricing system",
			"Batch recalculations - update hundreds of prices at once with a single click",
			"More accurate prices - no more guessing, everything is based on actual crafting costs"
		]
	},
	{
		"id": 14,
		"title": "Roadmap Improvements",
		"date": "2025-07-11",
		"type": "Enhancement",
		"description": "Improved the roadmap display with better organization and status clarity.",
		"changes": [
			"Sorted roadmap entries by status priority",
			"Added dependency tracking between features",
			"Completed items are now hidden by default",
			"Added new roadmap entry for Version-Aware Pricing and Recipe Integration"
		]
	},
	{
		"id": 13,
		"title": "All 1.17 Items Complete + 1.18 Ready! 🎉",
		"date": "2025-07-08",
		"type": "Content",
		"description": "All Minecraft 1.17 items have now been added to the price guide. Additionally, 1.18 support is now complete as it only required adding 1 new disc item.",
		"changes": [
			"Completed all 1.17 items including copper blocks, deepslate, candles, azalea items, and amethyst variants",
			"Added comprehensive pricing for all 1.17 content (101 total items)",
			"1.18 version support is now complete with the addition of Music Disc 'otherside'"
		]
	},
	{
		"id": 12,
		"title": "All 1.16 Items Complete (Except Brewing) - Major Milestone! 🎉",
		"date": "2025-07-03",
		"type": "Content",
		"description": "🎉 Another major milestone achieved! All Minecraft 1.16 items have now been categorized and priced, with the exception of the upcoming brewing category. This represents hundreds of items across all categories.",
		"changes": [
			"Completed all remaining 50 or so 1.16 items with accurate pricing",
			"These items were nether star, kelp, turtle shell, fireworks and minecarts to name a few",
			"Only brewing category remains for complete 1.16 coverage"
		]
	},
	{
		"id": 11,
		"title": "Homepage UI Improvements",
		"date": "2025-07-03",
		"type": "Enhancement",
		"description": "Small but effective UI improvements to the homepage for better user experience and customization.",
		"changes": [
			"Added layout setting (comfortable/condensed) for table density preference",
			"Reduced font size for category filters for cleaner appearance",
			"Added option to hide/show category filters to reduce clutter"
		]
	},
	{
		"id": 10,
		"title": "Multi-Version Support Now Live! 🚀",
		"date": "2025-07-01",
		"type": "Feature",
		"description": "Major infrastructure update! The price guide now supports multiple Minecraft versions. You can switch between 1.16 and 1.17 versions, with more versions being added progressively. Note there's only a handful of 1.17 items at this point. This foundation enables me to expand to all Minecraft versions over time.",
		"changes": [
			"Added version selector on homepage - switch between Minecraft versions",
			"Currently supporting 1.16 and 1.17 versions",
			"Smart filtering - items only show for their supported versions",
			"Foundation laid for adding 1.18, 1.19, 1.20, 1.21 and future versions"
		]
	},
	{
		"id": 9,
		"title": "All 1.16 Enchanted Books Added with Accurate Pricing!",
		"date": "2025-06-28",
		"type": "Content",
		"description": "🎉 Complete enchanted book catalog is now live! Added all 110 enchanted books covering every enchantment type and level from Minecraft 1.16. Each book has been priced accurately based on rarity, usefulness, and market demand.",
		"changes": [
			"Added all 110 enchanted books with accurate pricing",
			"Price range from 80 (Bane of Arthropods I) to 1400 (Mending)",
			"New 'Enchantments' category for easy browsing"
		]
	},
	{
		"id": 8,
		"title": "Price Customization, List View & Table Sorting",
		"date": "2025-06-28",
		"type": "Feature",
		"description": "Major UX enhancement introducing customizable pricing and flexible viewing options for better user experience.",
		"changes": [
			"Added price customization controls (buy multiplier and sell percentage)",
			"New 'List' view option alongside traditional 'Categories' view",
			"Alphabetical sorting by default in List view",
			"Clickable column headers for sorting by item name or buy price",
			"'Round to whole' option for cleaner price display",
			"All settings are automatically saved and remembered",
			"Improved decimal precision for accurate pricing calculations"
		]
	},
	{
		"id": 7,
		"title": "Complete 1.16 catalog (pricing and images) - COMPLETED!",
		"date": "2025-06-27",
		"type": "Content",
		"description": "🎉 Major milestone achieved! All 19 categories in the 1.16 catalog now have complete pricing and correct images. This includes Ores, Stone, Earth, Sand, Wood, Drops, Food, Utility, Plants, Redstone, Nether, Ocean, Tools, Weapons, Armor, End, Ice, Dyed, and Discs categories. The price guide is now fully functional for all included items!"
	},
	{
		"id": 1,
		"title": "Smart number formatting for prices and item count on category filters",
		"date": "2025-06-25",
		"type": "Enhancement",
		"description": "Large numbers now display with smart formatting (20k instead of 20000, 1.3M instead of 1300000) making prices easier to read at a glance. Category filters now display the item count."
	},
	{
		"id": 1,
		"title": "Catalog update: Armor, End, Ice and Dyed prices added + updated images. Books category removed.",
		"date": "2025-06-25",
		"type": "Content",
		"description": "Added prices to all the items within the Armor, End, Ice and Dyed categories. Fixed incorrect images as well. Moved Book, Book and Quill and Bookshelf into the Utility category. Removed the Books category all together. I'll be making an 'Enchantments' category later instead."
	},
	{
		"id": 1,
		"title": "Catalog update: Ocean items, Tools and Weapons priced + updated images",
		"date": "2025-06-23",
		"type": "Content",
		"description": "Added prices to all the items within the Ocean, Tools and Weapons categories. Fixed incorrect images as well."
	},
	{
		"id": 1,
		"title": "Catalog update: Nether items priced and updated images",
		"date": "2025-06-22",
		"type": "Content",
		"description": "Added prices to all the items within the Nether category. Fixed incorrect images as well."
	},
	{
		"id": 1,
		"title": "Added an 'Update' page with latest updates and roadmap",
		"date": "2025-06-20",
		"type": "Content",
		"description": "Added this page to show you all that stuff is happening :)"
	},
	{
		"id": 2,
		"title": "Almost Complete 1.16 Items List, Search and Categories Filtering",
		"date": "2025-05-19",
		"type": "Feature",
		"description": "Major content update adding almost all items from Minecraft 1.16 with categories and item search.",
		"changes": [
			"Added almost complete 1.16 items",
			"Total of 20 item categories",
			"Category filtering",
			"Search functionality across all items"
		]
	}
]
